results/hey_c3_20260718_182012.txt

Summary:
  Total:	124.4911 secs
  Slowest:	8.2080 secs
  Fastest:	2.7263 secs
  Average:	4.0150 secs
  Requests/sec:	0.7470
  
  Total data:	71424 bytes
  Size/request:	768 bytes

Response time histogram:
  2.726 [1]	|■
  3.274 [68]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.823 [0]	|
  4.371 [0]	|
  4.919 [0]	|
  5.467 [0]	|
  6.015 [0]	|
  6.563 [0]	|
  7.112 [12]	|■■■■■■■
  7.660 [6]	|■■■■
  8.208 [6]	|■■■■


Latency distribution:
  10%% in 2.7373 secs
  25%% in 2.8107 secs
  50%% in 2.9191 secs
  75%% in 6.7813 secs
  90%% in 7.1932 secs
  95%% in 7.8647 secs
  0%% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0016 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0009 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	4.0147 secs, 2.7260 secs, 8.2076 secs
  resp read:	0.0002 secs, 0.0001 secs, 0.0004 secs

Status code distribution:
  [200]	93 responses